revk/ESP32-Flasher/main/Flasher.c
// Flasher
// See https://components.espressif.com/components/espressif/esp-serial-flasher/versions/1.3.1/examples/esp32_usb_cdc_acm_example?language=en

static const char TAG[] = "Flasher";

#include "revk.h"
#include "esp_sleep.h"
#include "esp_task_wdt.h"
#include <netdb.h>
#include <driver/gpio.h>
#include <driver/uart.h>
#include <driver/rtc_io.h>
#include <driver/sdmmc_host.h>
#include <sdmmc_cmd.h>
#include "esp_http_client.h"
#ifdef  CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
#include "esp_crt_bundle.h"
#endif
#include "esp_vfs_fat.h"
#include <sys/dirent.h>
#include "usb/usb_host.h"
#include "usb/cdc_acm_host.h"
#include "esp_loader.h"
#include "esp32_usb_cdc_acm_port.h"

struct
{
   uint8_t die:1;               // Shutdown
   uint8_t wifi:1;              // WiFi connected
   uint8_t reload:1;            // Re load manifest, etc
   uint8_t forceerase:1;        // Force erase
   uint8_t erase:1;             // Manifest says erase
   uint8_t connected:1;         // Connected
   uint8_t fileerror:1;         // File error
   uint8_t checked:1;           // Upgrade checked
} volatile b;
uint16_t manifests = 0;         // Bit map of manifests on SD
uint8_t progress = 0;           // Progress (LED)
char ledf = 'K',
   ledt = 'K',
   ledsd = 'B';                 // LED from/to and SD
uint8_t mac[6] = { 0 };         // Found mac
char chip[30] = { 0 };          // Found chip type

uint32_t badusb = 0;            // Last devices 0 even

uint32_t flashsize = 0;         // Found flash size

#define	BLOCK	4096
uint8_t block[BLOCK];

#ifdef  CONFIG_TINYUSB_MSC_MOUNT_PATH
const char sd_dir[] = CONFIG_TINYUSB_MSC_MOUNT_PATH;
#else
const char sd_dir[] = "/sd";
#endif


led_strip_handle_t strip = NULL;

const char *
mqtt_client_callback (int client, const char *prefix, const char *target, const char *suffix, jo_t j)
{
   if (client || !prefix || target || strcmp (prefix, topiccommand) || !suffix)
      return NULL;              // Not for us or not a command from main MQTTS
   if (!strcmp (suffix, "wifi"))
      b.wifi = 1;
   return NULL;
}

void
led_task (void *arg)
{
   if (strip)
   {
      uint8_t tick = 0;
      while (!b.die)
      {
         tick++;
         uint32_t f = revk_rgb (ledf);
         uint32_t t = revk_rgb (ledt);
         uint8_t p = progress;
         for (int i = 0; i < 10; i++)
         {
            uint8_t l = p;
            if (l > 10)
               l = 10;
            p -= l;
            if ((b.fileerror && (tick & 1)) || (f == t && i != progress / 10))
               led_strip_set_pixel (strip, i, 0, 0, 0); // Off
            else
               led_strip_set_pixel (strip, i,   //
                                    gamma8[l * ((t >> 16) & 255) / 10 + (10 - l) * ((f >> 16) & 255) / 10],     //
                                    gamma8[l * ((t >> 8) & 255) / 10 + (10 - l) * ((f >> 8) & 255) / 10],       //
                                    gamma8[l * ((t >> 0) & 255) / 10 + (10 - l) * ((f >> 0) & 255) / 10]);
         }
         if (b.fileerror && !(tick & 1))
            revk_led (strip, 10, 255, revk_rgb ('R'));
         else
            revk_led (strip, 10, 255, revk_rgb (ledsd));
         REVK_ERR_CHECK (led_strip_refresh (strip));
         usleep (100000);
      }
      for (int i = 0; i < 11; i++)
         revk_led (strip, i, 0, 0);
      REVK_ERR_CHECK (led_strip_refresh (strip));
   }
   vTaskDelete (NULL);
}

void
set_led (uint8_t p, char f, char t)
{                               // Set LED display state (if f==t then one LED at progress point)
   progress = p;
   if (f)
      ledf = f;
   if (t)
      ledt = t;
   //ESP_LOGE (TAG, "LED %c %c %d%%", ledf, ledt, progress);
}

void
btn_task (void *arg)
{
   if (btn.set)
   {
      while (!b.die)
      {
         if (revk_gpio_get (btn))
         {
            if (b.connected)
            {
               b.forceerase = 1;
               b.reload = 1;
            } else if (manifests)
            {
               uint8_t m = manifest;
               do
               {
                  m++;
                  if (m == 10)
                     m = 0;
               }
               while (!(manifests & (1 << m)));
               if (m != manifest)
               {
                  jo_t j = jo_object_alloc ();
                  jo_int (j, "manifest", m);
                  revk_setting (j);
                  jo_free (&j);
                  b.checked = 0;
                  b.reload = 1;
               }
            }
            while (revk_gpio_get (btn))
               usleep (100000);
            continue;
         }
         usleep (100000);
      }
   }
   vTaskDelete (NULL);
}

static void
usb_lib_task (void *arg)
{
   while (1)
   {
      uint32_t event_flags;
      usb_host_lib_handle_events (portMAX_DELAY, &event_flags);
      if (event_flags & USB_HOST_LIB_EVENT_FLAGS_NO_CLIENTS)
         usb_host_device_free_all ();
      if (!event_flags)
      {
         usb_host_lib_info_t i;
         usb_host_lib_info (&i);
         if (i.num_devices)
            badusb = 0;
         else
            badusb = uptime ();
      }
   }
}

void
host_error_cb (void)
{
   ESP_LOGE (TAG, "Host error");
}

void
device_disconnect_cb (void)
{
   ESP_LOGE (TAG, "Device disconnect");
   b.connected = 0;
}

void
device_connect_cb (usb_device_handle_t usb_dev)
{
   ESP_LOGE (TAG, "Device connect");
   b.connected = 1;
}

enum
{
   STATUS_ERROR,
   STATUS_SILENT,               // no data
   STATUS_EMPTY,                // 0xffffffff error
   STATUS_LOOPING,              // Starting multiple times
   STATUS_FAIL,                 // ATE: FAIL
   STATUS_PASS,                 // ATE: PASS
   STATUS_TIMEOUT,              // Not looping but not pass/fail
} target_status (void)
{
   uint32_t to = uptime () + 5;
   char buf[100];
   uint8_t p = 0;
   uint8_t rst = 0;
   while (uptime () <= to)
   {
      uint8_t c;
      esp_loader_error_t e = loader_port_read (&c, 1, 100);
      if (e == ESP_LOADER_ERROR_TIMEOUT)
         continue;
      if (e)
         return STATUS_ERROR;
      if (c >= ' ')
      {
         if (p < sizeof (buf) - 1)
            buf[p++] = c;
         continue;
      }
      if (!p)
         continue;
      buf[p] = 0;
      p = 0;
      if (!strcmp (buf, "invalid header: 0xffffffff"))
         return STATUS_EMPTY;
      if (!strcmp (buf, "ATE: PASS"))
         return STATUS_PASS;
      if (!strcmp (buf, "ATE: FAIL"))
         return STATUS_FAIL;
      if (!strncmp (buf, "Build:", 6) && rst++ > 4)
         return STATUS_LOOPING;
   }
   if (!rst)
      return STATUS_SILENT;
   return STATUS_TIMEOUT;
};

void
chip_info (void)
{                               // Get chip info
   const char *const chips[] =
      { "ESP8266", "ESP32", "ESP32S2", "ESP32C3", "ESP32S3", "ESP32C2", "ESP32C5", "ESP32H2", "ESP32C6", "ESP32P4", "ESP_MAX",
      "ESP_UNKNOWN"
   };
   char *c = chip;
   *c = 0;
   target_chip_t id = esp_loader_get_target ();
   if (id < sizeof (chips) / sizeof (*chips))
      c = stpcpy (c, chips[id]);
   uint8_t psram = 0;
   switch (id)
   {
   case ESP32S3_CHIP:
      {                         // We can get some more info...
         c = stpcpy (c, "MC");  // Always MC
         const uint32_t efuse = 0x60007000;
         const uint32_t block1 = efuse + 0x44;
         uint32_t r1,
           r2;
         if (!esp_loader_read_register (block1 + 12, &r1))
         {
            r1 = (r1 >> 21) & 7;
            if (r1 == 1)
               c = stpcpy (c, "PICO");
         }
         if (!esp_loader_read_register (block1 + 16, &r1) && !esp_loader_read_register (block1 + 20, &r2))
            psram = ((r1 >> 3) & 3) | ((r2 >> 17) & 4);
         break;
      }
   default:
      break;                    // Other chip types may be needed
   }
   flashsize = 0;
   if (!esp_loader_flash_detect_size (&flashsize) && flashsize)
      c += sprintf (c, "N%u", (uint8_t) (flashsize / 1024 / 1024));
   if (psram)
      c += sprintf (c, "R%u", psram);
   *c = 0;
   if (b.connected && !esp_loader_read_mac (mac))
      ESP_LOGE (TAG, "Chip %02X:%02X:%02X:%02X:%02X:%02X %s", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5], chip);
}

