revk/ESP32-Flasher/main/Flasher.c
char *manifestjson = NULL;      // Loaded manifest JSON
uint32_t manifestsize = 0;      // Total flash bytes
jo_t j = NULL;                  // Parsed manifest JSON

void
close_manifest (void)
{
   if (!manifestjson)
      return;
   jo_free (&j);
   free (manifestjson);
   manifestjson = NULL;
}

typedef void manifest_t (char *filename, char *url, int f, uint32_t address, uint32_t size);

void
scan_manifest (manifest_t cb)
{
   if (!j)
      return;
   jo_rewind (j);
   if (jo_find (j, "flash") == JO_ARRAY)
   {
      while (jo_next (j) == JO_OBJECT)
      {
         uint32_t address = 0;
         char *filename = NULL;
         char *url = NULL;
         while (jo_next (j) == JO_TAG)
         {
            if (!jo_strcmp (j, "filename") && !filename)
            {
               if (jo_next (j) == JO_STRING)
                  filename = jo_strdup (j);
            } else if (!jo_strcmp (j, "url") && !url)
            {
               if (jo_next (j) == JO_STRING)
                  url = jo_strdup (j);
            } else if (!jo_strcmp (j, "address") && !url)
            {
               jo_type_t t = jo_next (j);
               if (t == JO_NUMBER)
                  address = jo_read_int (j);
               else if (t == JO_STRING)
               {
                  char *a = jo_strdup (j);
                  address = strtoul (a, NULL, 16);
                  free (a);
               }
            } else
               jo_next (j);
         }
         if (filename)
         {
            char *fn = NULL;
            if (asprintf (&fn, "%s/%s", sd_dir, filename) >= 0)
            {
               int f = open (fn, O_RDONLY);
               if (f >= 0)
               {
                  struct stat s = { 0 };
                  fstat (f, &s);
                  if (cb)
                     cb (filename, url, f, address, s.st_size);
                  close (f);
               } else if (cb)
                  cb (filename, url, -1, address, 0);
               free (fn);
            }
         } else if (cb)
            cb (filename, url, -1, address, 0);
         free (filename);
         free (url);
      }
   }
}

void
upgrade_check (int f, char *filename, char *url)
{
   if (revk_link_down () || !filename || !url || b.checked)
      return;
   esp_http_client_config_t config = {
      .url = url,
      .timeout_ms = 30000,
   };
#ifdef  CONFIG_MBEDTLS_CERTIFICATE_BUNDLE
   config.crt_bundle_attach = esp_crt_bundle_attach;
#else
   config.use_global_ca_store = true;   /* Global cert */
#endif
   esp_http_client_handle_t client = esp_http_client_init (&config);
   if (!client)
      return;
   char *dl = NULL;
   asprintf (&dl, "%s/DOWNLOAD", sd_dir);
   char *fn = NULL;
   asprintf (&fn, "%s/%s", sd_dir, filename);
   esp_err_t e = 0;
   struct stat s = { 0 };
   char *h = NULL;
   if (!stat (fn, &s))
   {
      struct tm t;
      gmtime_r (&s.st_mtime, &t);
      asprintf (&h, "%.3s, %02d %.3s %4d %02d:%02d:%02d GMT", "SunMonTueWedThuFriSat" + t.tm_wday * 3, t.tm_mday,
                "JanFebMarAprMayJunJulAugSepOctNovDec" + t.tm_mon * 3, t.tm_year + 1900, t.tm_hour, t.tm_min, t.tm_sec);
      if (!e)
         e = esp_http_client_set_header (client, "If-Modified-Since", h);
   }
   ESP_LOGE (TAG, "Upgrade check %s %s %s", filename, url, h ? : "");
   if (!e)
      e = esp_http_client_open (client, 0);
   if (!e)
   {
      esp_http_client_fetch_headers (client);
      int status = esp_http_client_get_status_code (client);
      int len = 0;
      if (status / 100 == 2)
      {
         set_led (100, 'K', 'Y');
         b.fileerror = 1;
         int o = open (dl, O_CREAT | O_TRUNC | O_WRONLY, 0777);
         if (o < 0)
         {
            ESP_LOGE (TAG, "Cannot write %s", dl);
            esp_http_client_flush_response (client, &len);
         } else
         {
            uint32_t size = 0;
            while (1)
            {
               len = esp_http_client_read_response (client, (void *) block, sizeof (block));
               if (len <= 0)
                  break;
               write (o, block, len);
               size += len;
            }
            close (o);
            if ((e = unlink (fn)))
               ESP_LOGE (TAG, "Unlink fail %s %s", fn, esp_err_to_name (e));
            if ((e = rename (dl, fn)))
               ESP_LOGE (TAG, "Rename fail %s %s %s", dl, fn, esp_err_to_name (e));
            if (!e)
            {
               ESP_LOGE (TAG, "Upgraded %s %u", filename, size);
               b.reload = 1;
            }
         }
      } else
      {
         if (status != 304)
            ESP_LOGE (TAG, "Status %d %s", status, url);
         esp_http_client_flush_response (client, &len);
      }
   }
   if (e)
      ESP_LOGE (TAG, "Failed %s: %s", url, esp_err_to_name (e));
   free (h);
   free (dl);
   free (fn);
   esp_http_client_cleanup (client);
}


void
load_cb (char *filename, char *url, int f, uint32_t address, uint32_t size)
{
   if (!size)
      manifestsize = -1;
   else if (manifestsize != 1)
      manifestsize += size;
   upgrade_check (f, filename, url);
}

const char *
load_manifest (void)
{
   close_manifest ();
   char *fn = NULL;
   asprintf (&fn, "%s/manifest%d.json", sd_dir, manifest);
   int f = open (fn, O_RDONLY);
   if (f < 0)
   {
      free (fn);
      return "Failed to open";
   }
   struct stat s = { 0 };
   fstat (f, &s);
   if (!s.st_size || s.st_size > 10000)
   {                            // Silly
      close (f);
      free (fn);
      return "Silly size";
   }
   manifestjson = malloc (s.st_size);
   if (!manifestjson)
   {
      close (f);
      free (fn);
      return "Malloc fail";
   }
   if (read (f, manifestjson, s.st_size) != s.st_size)
   {
      close (f);
      free (manifestjson);
      manifestjson = NULL;
      free (fn);
      return "Read fail";
   }
   j = jo_parse_mem (manifestjson, s.st_size);
   if (!j)
   {
      close (f);
      free (manifestjson);
      manifestjson = NULL;
      free (fn);
      return "Bad JSON";
   }
   b.erase = (jo_find (j, "erase") == JO_TRUE);
   if (jo_find (j, "url") == JO_STRING)
   {
      char *url = jo_strdup (j);
      upgrade_check (f, fn + sizeof (sd_dir), url);
      free (url);
   }
   close (f);
   free (fn);
   manifestsize = 0;
   scan_manifest (load_cb);
   if (!b.reload && !revk_link_down ())
      b.checked = 1;
   if (manifestsize == -1)
      return "Missing files";
   if (!manifestsize)
      return "No files to flash";
   return NULL;
}

esp_loader_error_t
do_erase (void)
{
   b.forceerase = 0;
   ESP_LOGE (TAG, "Erase whole flash");
   uint32_t p = 0;
   while (p < flashsize && !b.reload)
   {
      set_led (p * 100 / flashsize, 'B', 'K');
      esp_loader_error_t e = esp_loader_flash_erase_region (p, BLOCK);
      if (e)
         return e;
      p += BLOCK;
   }
   return 0;
}

uint32_t flashcount = 0;
esp_loader_error_t flashe = 0;

void
flash_cb (char *filename, char *url, int f, uint32_t address, uint32_t size)
{
   ESP_LOGE (TAG, "Flash to %05X len %05X %s", address, size, filename);
   if (flashe || f < 0 || !size)
      return;
   flashe = esp_loader_flash_start (address, size, BLOCK);
   if (!flashe)
   {
      uint32_t p = 0;
      while (p < size)
      {
         set_led (flashcount * 100 / manifestsize, 'K', 'B');
         uint32_t s = read (f, block, BLOCK);
         flashe = esp_loader_flash_write (block, s);
         if (flashe)
            return;
         p += s;
         flashcount += s;
      }
   }
   flashe = esp_loader_flash_finish (false);
   if (!flashe)
      flashe = esp_loader_flash_verify ();
}

esp_loader_error_t
do_flash (void)
{
   ESP_LOGE (TAG, "Flash %u bytes", manifestsize);
   flashe = 0;
   flashcount = 0;
   scan_manifest (flash_cb);
   return flashe;
}

void
flash_task (void *arg)
{
   esp_err_t e = 0;
   // SD card set up
   revk_gpio_input (sdcd);
   sdmmc_card_t *card = NULL;
   sdmmc_slot_config_t slot = SDMMC_SLOT_CONFIG_DEFAULT ();
   sdmmc_host_t host = SDMMC_HOST_DEFAULT ();
   slot.clk = sdclk.num;
   slot.cmd = sdcmd.num;
   slot.d0 = sddat0.num;
   slot.d1 = sddat1.set ? sddat1.num : -1;
   slot.d2 = sddat2.set ? sddat2.num : -1;
   slot.d3 = sddat3.set ? sddat3.num : -1;
   slot.width = (sddat2.set && sddat3.set ? 4 : sddat1.set ? 2 : 1);
   if (slot.width == 1)
      slot.flags |= SDMMC_SLOT_FLAG_INTERNAL_PULLUP;    // Old boards?
   host.max_freq_khz = SDMMC_FREQ_HIGHSPEED;
   host.slot = SDMMC_HOST_SLOT_1;
   {                            // USB init
      const usb_host_config_t host_config = {
         .skip_phy_setup = false,
         .intr_flags = ESP_INTR_FLAG_LEVEL1,
      };
      cdc_acm_host_driver_config_t usb_config = {
         .driver_task_priority = 10,
         .driver_task_stack_size = 4096,
         .xCoreID = 0,
         .new_dev_cb = device_connect_cb,
      };
      e = usb_host_install (&host_config);
      if (!e)
         e = cdc_acm_host_install (&usb_config);
      if (e)
      {
         ledsd = 'R';
         ESP_LOGE (TAG, "USB init failed %s", esp_err_to_name (e));
         jo_t j = jo_object_alloc ();
         jo_string (j, "error", esp_err_to_name (e));
         jo_int (j, "code", e);
         revk_error ("USB", &j);
      }
   }
   revk_task ("usb-lib", usb_lib_task, NULL, 4);
   // Main loop
   while (!b.die && !revk_shutting_down (NULL))
   {
      ledsd = 'Y';
      ESP_LOGI (TAG, "Waiting SD");
      // Wait for SD card
      while (!revk_gpio_get (sdcd))
      {
         b.checked = 0;
         usleep (100000);
         continue;
      }
      ESP_LOGI (TAG, "Mounting SD");
      // Mount SD card
      esp_vfs_fat_sdmmc_mount_config_t mount_config = {
         .format_if_mount_failed = 1,
         .max_files = 2,
         .allocation_unit_size = 16 * 1024,
         .disk_status_check_enable = 1,
      };
      e = esp_vfs_fat_sdmmc_mount (sd_dir, &host, &slot, &mount_config, &card);
      if (e != ESP_OK)
      {
         ledsd = 'R';
         ESP_LOGE (TAG, "SD mount failed %s", esp_err_to_name (e));
         jo_t j = jo_object_alloc ();
         if (e == ESP_FAIL)
            jo_string (j, "error", "Failed to mount");
         else
            jo_string (j, "error", "Failed to initialise");
         jo_int (j, "code", e);
         revk_error ("SD", &j);
         while (revk_gpio_get (sdcd))
            usleep (100000);
         continue;
      }
      ESP_LOGI (TAG, "Mounted SD");
      ledsd = 'G';
      set_led (manifest * 10, 'Y', 'Y');

