revk/ESP32-Flasher/main/Flasher.c
      {                         // Check manifests
         manifests = 0;
         for (int i = 0; i < 10; i++)
         {
            char *fn;
            asprintf (&fn, "%s/manifest%d.json", sd_dir, i);
            if (!access (fn, R_OK))
               manifests |= (1 << i);
         }
      }
      {                         // Manifest
         const char *e = load_manifest ();
         if (e)
         {
            ESP_LOGE (TAG, "Manifest fail: %s", e);
            set_led (manifest * 10, 'R', 'R');
            b.fileerror = 1;
         } else
            b.fileerror = 0;
      }

      if (!b.fileerror)
      {
         // TODO how do we do serial via UART?
         ESP_LOGE (TAG, "Power on");
         revk_gpio_output (pwr5, 1);    // device on
         usb_host_lib_set_root_port_power (true);
         while (revk_gpio_get (sdcd) && !b.die && !b.reload && !revk_shutting_down (NULL))
         {
            b.fileerror = 0;
            if (badusb && badusb + 2 > uptime ())
               set_led (manifest * 10, 'R', 'R');       // Likely diff device
            else
               set_led (manifest * 10, 'M', 'M');
            if (b.wifi)
            {
               b.wifi = 0;
               revk_command ("upgrade", NULL);
               b.reload = 1;
               continue;
            }
            if (!b.connected)
            {
               usleep (100000);
               continue;
            }
            loader_esp32_usb_cdc_acm_config_t config = {
               .acm_host_error_callback = host_error_cb,
               .device_disconnected_callback = device_disconnect_cb,
               .device_pid = 0x1001,    // USB direct not serial chip...
               .connection_timeout_ms = 1000,
               .out_buffer_size = BLOCK,
               //.acm_host_serial_state_callback = host_serial_cb,
            };
            esp_loader_error_t e = loader_port_esp32_usb_cdc_acm_init (&config);
            if (e)
            {                   // try non JTAG
               config.device_pid = 0;
               e = loader_port_esp32_usb_cdc_acm_init (&config);
            }
            if (!e)
            {                   // Connected
               set_led (manifest * 10, 'O', 'O');
               uint8_t status = target_status ();
               if (b.connected && (b.forceerase || b.erase || (status != STATUS_PASS && status != STATUS_FAIL))
                   && status != STATUS_ERROR)
               {
                  ESP_LOGE (TAG, "Bootload");
                  esp_loader_connect_args_t a = ESP_LOADER_CONNECT_DEFAULT ();
                  e = esp_loader_connect_with_stub (&a);        // Some chips don't work with stub
                  if (e)
                  {
                     ESP_LOGE (TAG, "Failed to connect in downloader mode");
                     status = STATUS_ERROR;
                  }
                  if (status != STATUS_ERROR)
                     chip_info ();
                  if (status != STATUS_ERROR && !flashsize)
                  {
                     ESP_LOGE (TAG, "Failed to get chip info");
                     status = STATUS_ERROR;
                  }
                  if (status != STATUS_ERROR && jo_find (j, "chip") == JO_STRING && jo_strcmp (j, chip))
                  {
                     status = STATUS_ERROR;
                     char *c = jo_strdup (j);
                     ESP_LOGE (TAG, "Wrong chip %s expecting %s", chip, c);
                     free (c);
                     b.fileerror = 1;
                  }
                  if ((b.forceerase || b.erase) && status != STATUS_EMPTY && status != STATUS_ERROR && do_erase ())
                  {
                     status = STATUS_ERROR;
                     ESP_LOGE (TAG, "Erase failed");
                  }
                  if (status != STATUS_ERROR && do_flash ())
                  {
                     status = STATUS_ERROR;
                     ESP_LOGE (TAG, "Flash failed");
                  }
               }
               if (b.connected && !b.reload)
               {
                  ESP_LOGE (TAG, "Reset");
                  esp_loader_reset_target ();
                  status = target_status ();
               }
               switch (status)
               {
               case STATUS_PASS:
                  set_led (100, 'K', 'G');
                  break;
               case STATUS_FAIL:
                  set_led (100, 'K', 'R');
                  break;
               case STATUS_TIMEOUT:
                  set_led (50, 'R', 'G');
                  break;
               case STATUS_LOOPING:
                  set_led (90, 'K', 'R');
                  break;
               case STATUS_SILENT:
                  set_led (80, 'K', 'R');
                  break;
               case STATUS_EMPTY:
                  set_led (70, 'K', 'R');
                  break;
               default:
                  set_led (manifest * 10, 'R', 'R');
               }
               if (b.connected && !b.reload)
               {
                  ESP_LOGE (TAG, "Wait disconnect");
                  while (revk_gpio_get (sdcd) && b.connected && !b.reload && !revk_shutting_down (NULL))
                     usleep (100000);
               }
            }
            close_manifest ();
            loader_port_esp32_usb_cdc_acm_deinit ();
         }
         set_led (0, 'K', 'K');
         ESP_LOGE (TAG, "Power off");
         if (b.connected)
            usb_host_lib_set_root_port_power (false);
         revk_gpio_output (pwr5, 0);
      } else
         sleep (1);
      ESP_LOGI (TAG, "Dismounting SD");
      esp_vfs_fat_sdcard_unmount (sd_dir, card);
      ledsd = 'B';
      b.reload = 0;
   }

   usb_host_uninstall ();

   b.fileerror = 0;
   while (revk_shutting_down (NULL))
   {
      int p = revk_ota_progress ();
      if (p >= 0 && p <= 100)
         set_led (p, 'K', 'Y');
      usleep (100000);
   }
}

//--------------------------------------------------------------------------------
// Main
void
app_main ()
{
   ESP_LOGE (TAG, "Started");
   revk_boot (&mqtt_client_callback);
   revk_start ();
   revk_gpio_output (pwr3, 0);
   revk_gpio_output (pwr5, 0);
   {                            // LED
      led_strip_config_t strip_config = {
         .strip_gpio_num = led.num,
         .max_leds = 11,
         .color_component_format = LED_STRIP_COLOR_COMPONENT_FMT_GRB,
         .led_model = LED_MODEL_WS2812, // LED strip model
         .flags.invert_out = led.invert,
      };
      led_strip_rmt_config_t rmt_config = {
         .clk_src = RMT_CLK_SRC_DEFAULT,        // different clock source can lead to different power consumption
         .resolution_hz = 10 * 1000 * 1000,     // 10 MHz
      };
#ifdef	CONFIG_IDF_TARGET_ESP32S3
      rmt_config.flags.with_dma = true;
#endif
      REVK_ERR_CHECK (led_strip_new_rmt_device (&strip_config, &rmt_config, &strip));
      revk_task ("led", led_task, NULL, 4);
   }
   revk_gpio_input (btn);
   revk_task ("btn", btn_task, NULL, 4);
   revk_task ("flash", flash_task, NULL, 16);
}
